# 1.	Explore inner join; outer join; left join and right join respectively.

In [1]:
import pandas as pd

data1 = {
    "StudentID" : [1,2,3,4],
    "Name" : ["Alice", "Bob", "Charlie", "David"]
}

df1 = pd.DataFrame(data1)

data2 = {
    "StudentID" : [3,4,5,6],
    "Grade" : ["A", "B", "C", "D"]
}

df2 = pd.DataFrame(data2)

In [2]:
inner = df1.join(df2.set_index("StudentID"), how = "inner", on = "StudentID")
inner

#Only has StudentID 3 and 4

   StudentID     Name Grade
2          3  Charlie     A
3          4    David     B

In [3]:
left = df1.join(df2.set_index("StudentID"), how = "left", on = "StudentID")
left

#Has all studentIDs from data1 but is missing 2 grades.

   StudentID     Name Grade
0          1    Alice   NaN
1          2      Bob   NaN
2          3  Charlie     A
3          4    David     B

In [4]:
right = df1.join(df2.set_index("StudentID"), how = "right", on = "StudentID")
right

#Has all studentIDs from data2 but is missing 2 names

     StudentID     Name Grade
2.0          3  Charlie     A
3.0          4    David     B
NaN          5      NaN     C
NaN          6      NaN     D

In [5]:
outer = df1.join(df2.set_index("StudentID"), how = "outer", on = "StudentID")
outer

#Has all data, but has a lot of null values

     StudentID     Name Grade
0.0          1    Alice   NaN
1.0          2      Bob   NaN
2.0          3  Charlie     A
3.0          4    David     B
NaN          5      NaN     C
NaN          6      NaN     D

# 2.	Create a dataframe:

In [6]:
data = {
    'Salesperson': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob', 'Charlie'],
    'Product': ['Widget', 'Widget', 'Gadget', 'Gadget', 'Widget', 'Gadget'],
'Quantity': [4, 2, 3, 5, 6, 1]}

df = pd.DataFrame(data)
df

  Salesperson Product  Quantity
0       Alice  Widget         4
1         Bob  Widget         2
2     Charlie  Gadget         3
3       Alice  Gadget         5
4         Bob  Widget         6
5     Charlie  Gadget         1

In [7]:
# -	Group the data by 'Salesperson' and calculate the total 'Quantity' sold by each salesperson.

df.groupby("Salesperson")["Quantity"].sum()

Salesperson
Alice      9
Bob        8
Charlie    4
Name: Quantity, dtype: int64

In [8]:
# -	Group the data by 'Product' and find the average 'Quantity' sold.

df.groupby("Product")["Quantity"].mean()

Product
Gadget    3.0
Widget    4.0
Name: Quantity, dtype: float64